{
  "sflags":{
    "F0":"U.S. Cooperative Summary of the Day (NCDC DSI-3200)",
    "F6":"CDMP Cooperative Summary of the Day (NCDC DSI-3206)",
    "F7":"U.S. Cooperative Summary of the Day -- Transmitted via WxCoder3 (NCDC DSI-3207) real-time data (since January 1, 2006)",
    "Fa":"Australian data from the Australian Bureau of Meteorology",
    "FB":"U.S. ASOS data for October 2000-December 2005 (NCDC DSI-3211)",
    "Fb":"Belarus update",
    "FC":"Environment Canada",
    "FD":"Short time delay US National Weather Service CF6 daily summaries provided by the High Plains Regional Climate Center",
    "FE":"European Climate Assessment and Dataset (Klein Tank et al., 2002)",
    "FF":"U.S. Fort data ",
    "FG":"Official Global Climate Observing System (GCOS) or other government-supplied data",
    "FH":"High Plains Regional Climate Center real-time data",
    "FI":"International collection (non U.S. data received through personal contacts)",
    "FK":"U.S. Cooperative Summary of the Day data digitized from paper observer forms (from 2011 to present)",
    "FM":"Monthly METAR Extract (additional ASOS data)",
    "Fm":"Data from the Mexican National Water Commission (Comision National del Agua -- CONAGUA)",
    "FN":"Community Collaborative Rain, Hail,and Snow (CoCoRaHS)",
    "FQ":"Data from several African countries that had been quarantined that is, withheld from public release until permission was granted from the respective meteorological services",
    "FR":"NCEI Reference Network Database (Climate Reference Network and Regional Climate Reference Network)",
    "Fr":"All-Russian Research Institute of Hydrometeorological Information-World Data Center",
    "FS":"Global Summary of the Day (NCDC DSI-9618) NOTE: 'S' values are derived from hourly synoptic reports exchanged on the Global Telecommunications System (GTS). Daily values derived in this fashion may differ significantly from 'true' daily data, particularly for precipitation  (i.e., use with caution).",
    "Fs":"China Meteorological Administration/National Meteorological Information Center Climatic Data Center (http://cdc.cma.gov.cn)",
    "FT":"SNOwpack TELemtry (SNOTEL) data obtained from the U.S. Department of Agriculture's Natural Resources Conservation Service",
    "FU":"Remote Automatic Weather Station (RAWS) data obtained from the Western Regional Climate Center",
    "Fu":"Ukraine update",
    "FW":"WBAN/ASOS Summary of the Day from NCDC's Integrated Surface Data (ISD).",
    "FX":"U.S. First-Order Summary of the Day (NCDC DSI-3210)",
    "FZ":"Datzilla official additions or replacements",
    "Fz":"Uzbekistan update"
  },
  "mflags":{
    "F":"no measurement information applicable",
    "FB":"precipitation total formed from two 12-hour totals",
    "FD":"precipitation total formed from four six-hour totals",
    "FH":"represents highest or lowest hourly temperature (TMAX or TMIN) or the average of hourly values (TAVG)",
    "FK":"converted from knots",
    "FL":"temperature appears to be lagged with respect to reported hour of observation",
    "FO":"converted from oktas",
    "FP":"identified as 'missing presumed zero' in DSI 3200 and 3206",
    "FT":"trace of precipitation, snowfall, or snow depth",
    "FW":"converted from 16-point WBAN code (for wind direction)"
  },
  "qflags":{
    "F":"did not fail any quality assurance check",
    "FD":"failed duplicate check",
    "FG":"failed gap check",
    "FI":"failed internal consistency check",
    "FK":"failed streak/frequent-value check",
    "FL":"failed check on length of multiday period ",
    "FM":"failed megaconsistency check",
    "FN":"failed naught check",
    "FO":"failed climatological outlier check",
    "FR":"failed lagged range check",
    "FS":"failed spatial consistency check",
    "FT":"failed temporal consistency check",
    "FW":"temperature too warm for snow",
    "FX":"failed bounds check",
    "FZ":"flagged as a result of an official Datzilla investigation"
  },
  "network": {
    "0":"unspecified (station identified by up to eight alphanumeric characters)",
    "1":"Community Collaborative Rain, Hail,and Snow (CoCoRaHS) based identification number.  To ensure consistency with with GHCN Daily, all numbers in the original CoCoRaHS IDs have been left-filled to make them all four digits long.  In addition, the characters '-'' and '_' have been removed to ensure that the IDs do not exceed 11 characters when preceded by 'US1'. For example, the CoCoRaHS ID 'AZ-MR-156' becomes 'US1AZMR0156' in GHCN-Daily",
    "C":"U.S. Cooperative Network identification number (last six characters of the GHCN-Daily ID)",
    "E":"Identification number used in the ECA&D non-blended dataset",
    "M":"World Meteorological Organization ID (last five characters of the GHCN-Daily ID)",
    "N":"Identification number used in data supplied by a National Meteorological or Hydrological Center",
    "R":"U.S. Interagency Remote Automatic Weather Station (RAWS) identifier",
    "S":"U.S. Natural Resources Conservation Service SNOwpack TELemtry (SNOTEL) station identifier",
    "W":"WBAN identification number (last five characters of the GHCN-Daily ID)"
  }
}
